Demp.SimpleSoapService/bin/Data/DM/getPreparation/Req/AMET02.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:biz="http://biz.dms.pms.model.ha.org.hk/">
   <soapenv:Header/>
   <soapenv:Body>
      <biz:getPreparation>
         <arg0>
            <dispHospCode></dispHospCode>
            <dispWorkstore></dispWorkstore>
            <itemCode>AMET02</itemCode>
            <trueDisplayname>AMETHOCAINE</trueDisplayname>
            <formCode>MIN</formCode>
            <saltProperty>HCL</saltProperty>
            <drugScope>I</drugScope>
            <specialtyType>I</specialtyType>
            <pasSpecialty></pasSpecialty>
            <pasSubSpecialty></pasSubSpecialty>
            <costIncluded>true</costIncluded>
            <hqFlag>true</hqFlag>
         </arg0>
      </biz:getPreparation>
   </soapenv:Body>
</soapenv:Envelope>